export const termsText = `
제1조 (목적)

본 약관은 ㈜오지구(이하 “회사”라 합니다)가 온라인으로 제공하는 웹 사이트(이하 “사이트”라고 합니다) 및 제반서비스(이하 “서비스”라 합니다)의 이용과 관련하여 회사와 이용자와의 권리, 의무 및 책임사항 등을 규정함을 목적으로 합니다.

제2조 (정의)

이 약관에서 사용하는 용어의 정의는 다음과 같습니다.

회사 : 사이트의 콘텐츠 및 서비스를 제공하는 자를 말합니다.
이용자 : 회사가 제공하는 서비스에 접속하여 본 약관에 따라 회사의 이용절차에 동의하고 회사가 제공하는 서비스를 이용하는 회원과 비회원을 통칭합니다.
회원 : 회사가 정한 가입 양식에 따라 이용계약을 체결하고 이용자 아이디(ID)를 부여받은 자를 말합니다.
비회원 : 회원이 아니면서 회사가 제공하는 서비스를 이용하는 자를 말합니다.
아이디(ID) : 회원의 식별과 회원의 서비스 이용을 위하여 회원이 설정하고 회사가 승인하는 문자나 숫자 혹은 그 조합을 말합니다.
비밀번호(PASSWORD) : 회원이 부여받은 아이디(ID)와 일치된 회원임을 확인하고, 회원 자신의 비밀을 보호하기 위하여 회원이 정한 문자와 숫자의 조합을 말합니다.
닉네임 : 서비스 이용을 위하여 회원이 선정하고 회사가 승인한 문자나 숫자 혹은 그 조합으로 서비스 이용시 회원을 구분하고 지칭하고 나타내는 명칭을 말합니다.
포인트 : 각 회원에게 부여되는 점수로 서비스 내에서의 활동 정도 및 서비스의 이용에 따라 증감되는 수치를 말합니다.
제3조 (약관의 효력 및 변경)

본 약관의 내용은 회원이 쉽게 알 수 있도록 서비스 화면에 게시하거나 별도의 게시판에 공지할 경우 효력이 발생됩니다.
회사는 필요하다고 인정되는 경우 본 약관을 변경할 수 있으며, 회사과 약관을 변경할 경우에는 기존의 약관 내용과 함께 변경일, 변경 내용을 제1항의 방법으로 공지합니다.
회사가 제2항에 따라 약관의 변경을 공지 또는 통지하면서 변경된 약관의 적용일까지 거부 의사를 표시하지 않으면 약관 변경에 동의한 것으로 간주하며 회원은 변경된 약관에 동의하지 않는 경우 이용 계약을 해지할 수 있습니다.
제4조 (약관 외 준칙)

본 약관에 명시되지 아니한 사항에 대해서는 전기통신기본법, 전기통신사업법, 정보통신망 이용촉진 및 정보보호 등에 관한 법률 및 기타 관련 법령의 규정에 따릅니다.

제5조 (이용계약의 성립)

이용계약은 회원이 되고자 하는 이용자(이하 “가입신청자”)가 본 약관 및 개인정보처리방침에 동의한 다음 회사가 정한 소정의 양식을 작성하여 제출한 신청을 승낙함으로써 체결됩니다.

제6조 (이용 신청의 승낙 및 유보)

가입신청자는 회사가 정한 소정의 양식에 필요한 정보를 입력하고 이용을 신청합니다
회사는 각 호에 해당하는 경우 이용 승낙을 하지 않거나 취소시킬 수 있습니다.
①본인의 실명, 명의가 아니거나 타인의 명의를 사용하여 신청하였을 때

②기타 관련 법령을 위반하거나 회사가 정한 요건에 맞지 않게 이용을 신청한 경우

③이용 신청의 내용을 허위로 기재한 경우

④스스로 서비스 이용계약을 해지한 회원이 해지일로부터 30일이 지나지 않은 상태에서 신청하는 경우

⑤약관 위반 등을 이유로 회사에 의해 이용계약이 해지된 회원이 해지일로부터 6개월 이내에 신청하는 경우

⑥기타 회사가 정한 이용신청 요건에 미비한 경우

제7조 (회원 정보의 변경)

회원은 개인정보관리화면을 통하여 언제든지 자신의 개인정보를 열람하고 수정할 수 있습니다.
회원은 이용 신청 시 기재한 사항이 변경되었을 경우 온라인으로 수정하거나 전자우편 등 기타 방법으로 회사에 변경 사항을 알려야 합니다. (회사는 회원이 변경 사항을 알리지 않아 발생한 불이익에 대하여 책임을지지 않습니다.)
회사는 3개월 이상 로그인하지 않은 회원을 휴면회원으로 분류할 수 있습니다. 다른 회원이 휴면 회원의 닉네임을 사용하고자 하는 경우, 회사는 휴면회원에게 임시 닉네임을 부여하고 다른 회원에게 닉네임 사용을 허랑할 수 있습니다. 임시 닉네임이 지정된 휴면회원은 새로운 닉네임을 지정할 수 있습니다.
다음 각 호의 어느 하나에 해당하는 경우 회사는 해당 닉네임의 사용을 금지하고 임시 닉네임을 부여할 수 있습니다. 이 경우 회원은 새로운 닉네임을 지정하여 사용을 신청할 수 있습니다.
①닉네임이 회원 자신이나 제3자의 개인정보를 포함하고 있는 경우

②닉네임이 타인에게 혐오감을 주는 경우

③닉네임에 욕설이나 범죄에 대한 내용이 포함된 경우

④닉네임이 사회의 질서나 미풍양속에 반하는 경우

⑤닉네임에 제3자를 비방하거나 분쟁을 야기하는 내용이 포함된 경우

제8조 (회원에 대한 통지)

회사가 특정 회원에게 서비스에 관한 통지를 하는 경우 회원정보에 등록된 이메일을 사용할 수 있습니다.
회사가 전체 이용자에 대한 통지를 하는 경우 7일 이상 공지사항 게시판에 게시함으로써 개별 통지에 갈음할 수 있습니다. 다만, 회원 본인의 관련하여 중대한 영향을 미치는 사항에 대하여는 제1항을 따릅니다.
제9조 (회원의 개인정보)

회사는 서비스를 제공하기 위하여 관련 법령에 규정에 따라 회원으로부터 필요한 개인정보를 수집합니다. (개인정보에 대한 개별 항목은 개인정보처리방침에 고지)

제10조 (회사의 의무)

회사는 법령과 본 약관이 금지하거나 공서양속에 반하는 행위는 하지 않으며 본 약관이 정하는 바에 따라 지속적이고, 안정적인 서비스를 제공하기 위해 노력합니다.
회사는 이용자가 안전하고 편리하게 서비스를 이용할 수 있도록 시스템을 구축하고 유지, 점검 및 복구 등의 조치를 이행합니다.
제3자가 회사와 계약을 체결하고, 이에 근거하여 회사의 회원들에게 서비스를 제공하고자 하는 경우. 회사는 이용자가 동의하는 범위 내에서 제3자에게 회원의 개인정보를 제공할 수 있고, 이 경우 회사는 회원의 개인정보를 보호하기 위한 관련법령을 준수합니다.
회사는 회원의 승낙 없이 회원의 개인 신상 정보를 제3자에게 누설하거나 배포하지 않습니다. (단. 전기통신기본법 등 법률의 규정에 의해 국가기관의 요구가 있는 경우, 범죄에 대한 수사상의 목적이 있거나 또는 기타 관계법령에서 정한 절차에 의한 요청이 있을 경우에는 그러하지 아니합니다.)
제11조 (회원의 의무)
1. 회원은 관계법령, 본 약관의 규정, 이용수칙 등 회사가 공지 또는 통지하는 사항을 항시 준수하여야 합니다.

회원의 아이디와 비밀번호에 관한 관리책임은 회원 본인에게 있으며, 관리 소홀, 부정 사용 등에 의하여 발생하는 모든 결과에 대한 책임은 회원이 부담합니다.
회원은 서비스 이용과 관련하여 다음에 해당되는 행위를 하여서는 안됩니다.
타인의 아이디를 이용하여 부당하게 서비스를 이용하는 행위
회사 또는 제3자의 저작권, 초상권 및 기타 권리를 침해하는 행위
공공질서 및 미풍양속에 위반되는 내용을 유포하는 행위
범죄와 결부된다고 객관적으로 판단되는 행위
선정적이거나 사회적 물의를 일으키는 내용을 유포하는 행위
상습적으로 회원간 분쟁을 유도하는 등 커뮤니티의 발전을 저해하는 행위
바이러스, 악성 코드 등을 유포하거나 해킹을 시도하는 행위
다량의 정보를 전송하거나 광고성 정보를 전송하여 서비스의 안정적 운영을 방해하는 행위
회사 및 계약사의 운영진, 관리자, 관계자를 사칭하는 행위
위 각 호의 내용이 포함되었다고 판단되는 닉네임을 사용하는 행위
회사의 서비스를 방해하거나, 서비스에 고의적으로 피해를 끼치는 행위
기타 관계 법령에 위배되는 행위
제12조 (서비스 이용 범위)

회사는 필요한 경우 회사가 부여한 회원의 등급에 따라 일부 서비스에 대해 접근을 제한할 수 있습니다.

제13조 (정보의 제공)

회사는 서비스 이용 중 필요하다고 인정되는 다양한 정보를 공지사항이나 전자우편, SMS(MMS) 등의 방법으로 회원에게 제공할 수 있습니다.
회사는 회원이 정보를 원치 않는다는 의사를 밝히는 경우 정보 제공 대상에서 해당 회원을 제외하여야 합니다. 다만, 회사는 이로 인해 발생한 불이익에 대하여 책임을 부담하지 않습니다.
제14조 (광고게재 및 광고주와의 거래)

회사가 제공하는 서비스에는 회사 이외의 광고주의 판촉활동을 위한 서비스가 포함되어 있습니다. 서비스를 이용하는 자는 서비스 이용 시 노출되는 광고게재에 대해 동의하는 것으로 간주됩니다.
회사는 본 사이트에 게재된 광고주의 광고나 판촉활동의 진실성을 담보하지 않으며, 회원이 본 사이트에 게재되어 있거나 본 서비스를 통한 광고주의 판촉활동에 참여하여 거래한 결과로서 발생하는 손실과 손해에 대해서는 책임을 지지 않습니다.
제15조 (공개 게시물의 삭제 또는 이용 제한)

회원의 공게 게시물의 내용이 각 호에 해당하는 경우 회사는 해당 공개 게시물에 대한 접근을 임시적으로 차단하는 조치를 취할 수 있고 본 약관 및 관계 법령에 따라 사전에 통지없이 삭제할 수 있습니다.
다른 회원 또는 제3자를 모욕하거나, 명예를 훼손하거나, 프라이버시를 침해하는 등의 내용
음란물, 유해매체물, 불법 촬영물, 욕설 등 공서양속에 위반되는 내용의 정보, 문장, 도형 등을 유포하는 내용
범죄행위, 불법 유해 정보와 관련이 있다고 판단되는 내용
다른 이용자 또는 제3자의 저작권 등 기타 권리를 침해하는 내용
종교적, 정치적 분쟁을 야기하는 내용으로서, 분쟁으로 인해 회사의 업무가 방해되거나 방해되리라 판단되는 내용
타인의 개인정보, 사생활을 침해하거나 명예훼손 시키는 내용
동일한 내용을 중복하거나 다수 게시하여 이용 목적에 어긋나는 행위
불필요하거나 승인되지 않은 광고, 판촉물을 게재하는 경우
기타 관계 법령에 위반된다고 판단되는 경우
회원은 차단, 삭제된 게시글에 대해 부당하다고 생각될 경우 회사에 이유과 근거를 요청할 수 있으며 회원의 문의가 합당한 경우 복구조치를 취해야 함
제16조 (게시물의 저작권)

회원이 서비스 내에 게시한 게시물의 저작권은 해당 게시물의 저작자에게 귀속됩니다.
회원은 서비스를 이용하여 얻은 정보를 가공, 판매하는 행위 등 서비스에 게제된 자료를 상업적으로 사용할 수 없습니다.
회사 또는 회원이 저작물을 사용하는 경우 저작물을 게시한 저작자의 허락을 받습니다.
제17조 (서비스 제공 및 중단)

회사는 업무상, 기술상의 문제를 제외하고, 연중무휴 1일 24시간 제공을 원칙으로 합니다.
회사는 서비스 제공에 필요한 경우 점검 및 수정을 위한 이용 제한을 실시할 수 있습니다.이 경우 회사는 제8조(회원에 대한 통지)에 정한 방법으로 이용자에게 통지합니다. 다만, 회사가 사전에 통지할 수 없는 부득이한 사유가 있는 경우 사후에 통지할 수 있습니다.
제18조 (포인트 이용)

회사는 회원의 활동 및 서비스 이용 정도에 따라 포인트를 지급하거나 차감할 수 있습니다.
포인트 제도는 회사의 서비스 정책의 변동에 따라 변경될 수 있으며, 중대한 변경이 있을 경우 이는 사전에 공지합니다.
회원은 포인트를 타인에게 양도할 수 없으며 부정적인 방법으로 포인트 획득, 사용이 적발될 경우 회사의 판단에 의해 포인트가 차감될 수 있습니다.
(피드백 수정/추가 고려 – 포인트가 차감될 수 있으며 해당 사안이 중대한 경우 회원 이용 제한 조치가 취해질 수 있습니다.)

제19조 (계약해지 및 이용제한)

회원은 언제든지 온라인을 통해 이용 계약을 해지할 수 있습니다.
회사는 제11조, 제14조를 포함하여 본 약관 조항을 위반하거나, 회사의 정상적인 서비스 운영을 방해하는 경우 사전통지 없이 경고, 일부 서비스 이용 중지, 포인트 차감,이용계약 해지 등의 조치를 취할 수 있습니다.
회사는 본 약관 외에도 일부 서비스에 적용되는 이용 수칙을 수립하여 회원들에게 공지할 수 있습니다. 회사는 회원들이 이용 수칙을 위한한 경우에도 제2항에 규정된 조치를 취할 수 있습니다.
회사는 “정보통신망 이용촉진 및 정보보호 등에 관한 법률”에 따라 회원이 작성한 게시물에 대하여 삭제 또는 임시조치를 할 수 있고 관련법령을 준수하기 위하여 회원의 서비스 이용을 제한할 수 있습니다.
제20조 (면책 조항)

회사는 천재지변 또는 이제 준하는 불가항력으로 인하여 서비스를 제공할 수 없는 경우에는 서비스 제공 장애로 인한 관련 책임이 면제됩니다.
회사는 회원의 귀책사유로 인한 서비스 이용의 장애에 대하여 책임을지지 않습니다.
회사는 회원이 서비스와 관련하여 게재한 정보, 자료, 사실의 신뢰도, 정확성 등의 내용은 책임을 지지 않습니다.
회사는 서비스를 매개로 한 회원 간 거래 또는 회원과 제3자 상호간에 거래에 대하여 책임을 지지 않습니다.
회사는 서비스를 이용하여 기대하는 이익이나 서비스를 통하여 얻는 자료로 인한 손해에 관하여 책임을지지 않습니다.
제21조 (손해배상)

회사는 무료로 제공되는 서비스와 관련하여 회사의 고의 또는 중대 과실로 인한 손해를 제외하고 회원에게 어떠한 손해가 발생되어도 이에 대하여 책임을 부담하지 않습니다.

제22조 (준거법 및 관할법원)

회사와 회원 사이에 제기된 소송은 대한민국법을 준거법으로 합니다.
회사와 회원 사이에 발생한 소송의 관할법원은 민사소송법에 따라 정합니다.
전항에도 불구하고 해외에 주소나 거소가 있는 회사와 회원사이에 발생한 소송의 경우 회사의 소재지를 관할하는 법원을 전속 관할 법원으로 합니다.
`;

export const privacyText = `
개인정보처리방침입니다.
`;
